## 典型场景下安全组规则

为了您实例的安全性并能满足典型使用场景要求，需要您执行以下操作：

- 设置合理的端口放通策略。
- 登录 [安全组规则配置界面](https://console.cloud.tencent.com/cvm/securitygroup/detail)，并按以下模版配置入站规则。

>! 
- 以下仅为典型场景安全组**入站规则**的配置，如果您的实例需要对外访问（例如软件升级等），您可以放通出站规则下所有端口。

典型场景的安全组配置规则包含：

| 使用场景 | 类型 | 来源 |协议端口 |策略 |
|---------|---------|---------|---------|---------|
| SSH 远程登录 Linux 实例 | Linux 登录 | 0.0.0.0/0 |TCP:22 | 允许 |
| RDP 远程登录 Windows 实例| Linux 登录 | 0.0.0.0/0 |TCP:3389 | 允许 |
| 公网 ping CVM云服务器实例| Ping | 0.0.0.0/0 |ICMP | 允许 |
| CVM云服务器实例作 Web 服务器 | HTTP（80）| 0.0.0.0/0 |TCP:80 | 允许 |
| CVM云服务器实例作 Web 服务器  | HTTPS（443）| 0.0.0.0/0 |TCP:443 | 允许 |
| FTP 上传或下载文件 | 自定义 | 0.0.0.0/0 |TCP:20,21 | 允许 |
| FTP 上传或下载文件（被动模式） | 自定义 | 0.0.0.0/0 |TCP:21<br>TCP:1024-65535 | 允许 |
| Webshell 登录云服务器 | 自定义 | 0.0.0.0/0 |115.159.198.247<br>115.159.211.178<br>116.119.28.7.195<br>117.119.28.22.215<br>118.119.29.96.147<br>119.211.159.185.38 | 允许 |

## 其他服务器常用端口

如下是服务器常用端口介绍，关于 Windows 下更多的服务应用端口说明，请参考微软官方文档（[Windows 的服务概述和网络端口要求](https://support.microsoft.com/zh-cn/help/832017/service-overview-and-network-port-requirements-for-windows?spm=5176.7740724.2.3.omd4DB%3Fspm%3D5176.7740724.2.3.omd4DB)）。

| 端口 | 服务 | 说明 |
|---------|---------|---------|
| 21 | FTP | FTP 服务器所开放的端口，用于上传、下载。 |
| 22 | SSH | 22 端口就是 SSH 端口，用于通过命令行模式远程连接 Linux系统服务器。 |
| 25 | SMTP | SMTP 服务器所开放的端口，用于发送邮件。 |
| 80 | HTTP | 用于网站服务例如 IIS、Apache、Nginx 等提供对外访问。|
| 110 | POP3 | 110 端口是为 POP3（邮件协议 3）服务开放的。 |
| 137、138、139 | NETBIOS 协议 | 其中 137、138是 UDP 端口，当通过网上邻居传输文件时用这个端口。<br>而 139 端口：通过这个端口进入的连接试图获得 NetBIOS/SMB 服务。这个协议被用于 Windows 文件和打印机共享和 SAMBA。 |
| 143 | IMAP | 143 端口主要是用于“Internet Message AccessProtocol”v2（Internet 消息访问协议，简称 IMAP），和 POP3 一样，是用于电子邮件的接收的协议。 |
| 443 | HTTPS | 网页浏览端口，能提供加密和通过安全端口传输的另一种 HTTP。 |
| 1433 | SQL Server | 1433 端口，是 SQL Server 默认的端口，SQL Server 服务使用两个端口：TCP-1433、UDP-1434。其中 1433 用于供 SQL Server 对外提供服务，1434 用于向请求者返回 SQL Server 使用了哪个 TCP/IP 端口。 |
| 3306 | MySQL | 3306 端口，是 MySQL 数据库的默认端口，用于 MySQL 对外提供服务。|
| 3389 | Windows Server Remote Desktop Services（远程桌面服务）| 3389 端口是 Windows  2000(2003) Server 远程桌面的服务端口，可以通过这个端口，用“远程桌面”连接工具来连接到远程的服务器。 |
| 8080 | 代理端口 | 8080 端口同 80 端口，是被用于 WWW 代理服务的，可以实现网页浏览，经常在访问某个网站或使用代理服务器的时候，会加上“:8080”端口号。另外 Apache Tomcat web server 安装后，默认的服务端口就是 8080。 |
