当您的数据库实例初始化后，您可以使用任何标准的 SQL 客户端通过外网地址或内网地址连接到该实例。

## 获取内网地址
在实例详情页面，直接获取实例内网地址。
>?这里的内网地址是 VIP，是通过接入网关集群统一访问数据库实例，而非直接连接到数据库实例物理机上，因此当主机发生故障或主备切换时，内网 IP 都不会变化。

您可以在和 PostgreSQL **所属网络相同**的云服务器上，直接连接实例的**内网地址**访问 PostgreSQL 服务，此操作需要先安装客户端。

## 获取外网地址
在实例详情页面，直接开启实例外网地址。
![](https://mc.qcloudimg.com/static/img/4b234c3c28d06d00631ee071e77b2d7d/image.png)
>!外网地址仅适用于日常管理数据库。外网流量可能涉及费用，具体请参见 [产品价格](https://cloud.tencent.com/document/product/409/4993)。

- **内网访问**：使用云服务器 CVM 访问自动分配给云数据库的内网地址，这种访问方式使用内网高速网络，延迟低。CVM 和数据库须是同一账号，且同一个[ VPC](https://cloud.tencent.com/document/product/215/20046) 内（保障同一个地域），或同在基础网络内。
>?对于不同的 VPC 下（包括同账号/不同账号，同地域/不同地域）的 CVM 和数据库，内网连接方式请参见  [对等连接](https://cloud.tencent.com/document/product/553/18827)。

- **外网访问**：通过外网地址访问云数据库 PostgreSQL。
>!
>- 外网访问需要开启数据库实例的外网地址，此操作会使您的数据库服务暴露在公网上，可能导致数据库被入侵或攻击。建议您使用内网访问的方式来登录数据库。 
>- 云数据库外网访问适用于开发或辅助管理数据库，不建议正式业务访问使用，因为可能存在不可控因素会导致外网访问不可用（例如 DDOS 攻击、突发大流量访问等）。
>- 仅广州、上海、北京、成都、中国香港、硅谷的实例支持开启外网访问地址。

接下来，我们提供一种使用 pgAdmin 连接 PostgreSQL 实例的示例。
## 第一步
您可以从 [pgAdmin](https://www.pgadmin.org/download/) 下载,并在内网CVM服务器或外网PC上安装 pgAdmin。

## 第二步
单击【文件】菜单，选择【添加服务器】。

## 第三步
在【新建服务器登记】对话框中，填写名称、主机 IP 地址、端口号、用户名和密码。主机 IP 地址和端口号您可以从 PGSQL 实例管理页面中的【内网地址】找到，或实例详情中的【外网地址】找到。填写完成后单击【确定】。（为了您的数据安全，目前使用内网 IP.）用户名与密码请使用初始化实例时设置的数据库管理员用户与密码。
![](https://main.qcloudimg.com/raw/7fa4048a66f13d291b61531a4995e576.png)

## 第四步
在左侧的对象浏览器菜单中，双击【服务器组】展开该列表。选择刚刚连接好的服务器（数据库实例），并选择数据库的名称。

![](https://main.qcloudimg.com/raw/054419d2cd09a75529d8eb7900b73866.jpg)

## 第五步
启动 PSQL 控制台，首先单击如图所示的图标，选择 PSQL CONSOLE。即可在控制台中操作您的数据库了。
![](https://main.qcloudimg.com/raw/55a06ca46df8c0d104360d9fb16a1d29.jpg)

