
本文为您介绍创建初始化实例后，通过内网连接 KonisGraph 实例。

## 准备工作
- 准备已经初始化的 KonisGraph 实例。
- 准备好数据库 KonisGraph 实例的帐号和密码。
- 配置云服务器 CVM 安全组出入站规则，允许访问 KonisGraph 的 IP，请参见 [安全组](https://cloud.tencent.com/doc/product/213/500)。

## 连接方式
连接图数据库 KonisGraph 的方式有2种：
- 云服务器 CVM 连接。
云服务器 CVM 连接图数据库 KonisGraph 步骤依次为：gremlin-console 连接、图的元数据操作、图数据的读写。
连接的注意事项如下：
**内网地址连接**：通过内网地址连接图数据库 KonisGraph，使用云服务器 CVM 直接连接云数据库的内网地址，这种连接方式使用内网高速网络，延迟低。
 - 云服务器和数据库须是同一账号，且同一个[ VPC](https://cloud.tencent.com/document/product/215/20046) 内（保障同一个地域）。
 - 内网地址系统默认提供，可在 [KonisGraph 控制台](https://console.cloud.tencent.com/konisgraph) 的实例列表或实例详情页查看。
>?对于不同的 VPC 下（包括同账号/不同账号，同地域/不同地域）的云服务器和数据库，内网连接方式请参见 [云联网](https://cloud.tencent.com/document/product/877)。
>
- 图数据管理平台，参考 [图数据管理](https://cloud.tencent.com/document/product/1366/61194)。


## 云服务器连接
下面示例分别如何从云服务器内网连接图数据库 KonisGraph。

### 步骤1：gremlin-console 连接
1. [登录 Linux 云服务器](https://cloud.tencent.com/document/product/213/2936)，下载 [apache-tinkerpop-gremlin-console-3.5.1-bin](https://www.apache.org/dyn/closer.lua/tinkerpop/3.5.1/apache-tinkerpop-gremlin-console-3.5.1-bin.zip)。
2. 解压到任意目录，默认解压目录 `apache-tinkerpop-gremlin-console-3.5.1`。
3. 进入解压目录，创建连接配置文件 `remote-secure-test.yaml` 放到 `conf` 目录下。文件内容如下：
```yaml
# hosts 图数据库 KonisGraph 实例的内网地址 vip，如 10.xx.xx.107
hosts: [10.xx.xx.107]
# port 图数据库 KonisGraph 实例的 Gremlin 端口，如 8186
port: 8186
# username/password 图数据库 KonisGraph 实例的帐号和密码，如帐号：steven，密码：test-pwd-123
username: steven
password: test-pwd-123
connectionPool: {
  enableSsl: false,
  sslEnabledProtocols: [TLSv1.2] }
# serializer: { className: org.apache.tinkerpop.gremlin.driver.ser.GraphBinaryMessageSerializerV1, config: { serializeResultToString: true }}
serializer: { className: org.apache.tinkerpop.gremlin.driver.ser.GryoMessageSerializerV3d0, config: { serializeResultToString: true }}
```
4. 使用 `bin/gremlin.sh` 命令开始连接：
```bash
         \,,,/
         (o o)
-----oOOo-(3)-oOOo-----
plugin activated: tinkerpop.server
plugin activated: tinkerpop.utilities
plugin activated: tinkerpop.tinkergraph
gremlin> :remote connect tinkerpop.server conf/remote-secure-test.yaml
==>Configured 10.221.176.107/10.221.176.107:8186
gremlin> :remote console
==>All scripts will now be sent to Gremlin Server - [10.221.176.107/10.221.176.107:8186] - type ':remote console' to return to local mode
```

### 步骤2：图的元数据操作
以 [Gremlin-console tutorials](https://tinkerpop.apache.org/docs/3.5.1/tutorials/getting-started/#_the_first_five_minutes) 中的人和软件的关系图为示例。
![enter image description here](https://main.qcloudimg.com/raw/51a52aabf2b24289aa61f713a8cd1eb4.png)
如图所示，整个图包含2类点 person 和 software ，2类边 knows 和 created ，和几类属性 id 、name 、 age 、 lang 、 weight。

#### 创建属性
```bash
gremlin> s.addP('id', "T_LONG", "0")
==>id: 11
propertyName: "id"
dataType: T_LONG
defaultValue: "0"

gremlin> s.addP('name', "T_STRING", "")
==>id: 1
propertyName: "name"
dataType: T_STRING

gremlin> s.addP("age", "T_LONG", "0")
==>id: 2
propertyName: "age"
dataType: T_LONG
defaultValue: "0"

gremlin> s.addP("lang", "T_STRING", "")
==>id: 3
propertyName: "lang"
dataType: T_STRING

gremlin> s.addP("weight", "T_DOUBLE", "0.0")
==>id: 4
propertyName: "weight"
dataType: T_DOUBLE
defaultValue: "0.0"
```

#### 创建点
```bash
gremlin> s.addV("person", "id", ["name", "age"])
==>id: 7
name: "person"
primary_key: "id"
create_time: 1627894586026
properties: 1
properties: 2

gremlin> s.addV("software", "id", ["name", "lang"])
==>id: 8
name: "software"
primary_key: "id"
create_time: 1627894607209
properties: 1
properties: 3

gremlin>
```

#### 创建边
```bash
gremlin> s.addE("knows", "person", "person", ["weight"])
==>id: 9
name: "knows"
src_label_id: 7
dst_label_id: 7
create_time: 1627894691660
properties: 4

gremlin> s.addE("created", "person", "software", ["weight"])
==>id: 10
name: "created"
src_label_id: 7
dst_label_id: 8
create_time: 1627894710659
properties: 4

gremlin>
```

### 步骤3：图数据的读写
#### 写入点数据 person
```bash
gremlin> g.addV("person").property("id", 1).property("name", "marko").property("age", 29)
==>v[7.1]
gremlin> g.addV("person").property("id", 2).property("name", "vadas").property("age", 27)
==>v[7.2]
gremlin> g.addV("person").property("id", 4).property("name", "josh").property("age", 32)
==>v[7.4]
gremlin> g.addV("person").property("id", 6).property("name", "peter").property("age", 35)
==>v[7.6]
gremlin>
```

#### 写入点数据 software
```bash
gremlin> g.addV("software").property("id", 3).property("name", "lop").property("lang", "java")
==>v[8.3]
gremlin> g.addV("software").property("id", 5).property("name", "ripple").property("lang", "java")
==>v[8.5]
gremlin>
```

#### 写入边数据 knows
```bash
gremlin> g.addE("knows").from(g.V().has("name", "marko")).to(g.V().has("name", "vadas"))
==>e[9.1.2][7.1-knows->7.2]
gremlin> g.addE("knows").from(g.V().has("name", "marko")).to(g.V().has("name", "josh"))
==>e[9.1.4][7.1-knows->7.4]
gremlin>
```

#### 写入边数据 created
```bash
 g.addE("created").from(g.V().has("name", "marko")).to(g.V().has("name", "lop")).property("weight", "0.4")
==>e[10.1.3][7.1-created->8.3]
gremlin> g.addE("created").from(g.V().has("name", "peter")).to(g.V().has("name", "lop")).property("weight", "0.2")
==>e[10.6.3][7.6-created->8.3]
gremlin> g.addE("created").from(g.V().has("name", "josh")).to(g.V().has("name", "lop")).property("weight", "0.4")
==>e[10.4.3][7.4-created->8.3]
gremlin> g.addE("created").from(g.V().has("name", "josh")).to(g.V().has("name", "ripple")).property("weight", "1.0")
==>e[10.4.5][7.4-created->8.5]
gremlin>
```

#### [查询点边和属性数据](id:cxdbhsxsj)
```bash
# 查找所有的边
gremlin> g.E()
# 查找所有的点
gremlin> g.V()
==>v[7.1]
==>v[7.4]
==>v[7.2]
==>v[8.5]
==>v[7.6]
==>v[8.3]
gremlin> g.V(1).values('name')
==>marko
# marko 认识的人
gremlin> g.V(1).outE('knows').inV().values('name')
==>josh
==>vadas
# marko 认识的人里谁的年龄超过了30岁
gremlin> g.V(1).out('knows').has('age', gt(30)).values('name')
==>josh
# 哪些人创建了软件 lop
gremlin> g.V(3).in('created').values('name')
==>peter
==>marko
==>josh
gremlin>
```

## 图数据管理平台连接
通过图数据管理平台连接管理 KonisGraph 实例，请参考 [图数据管理](https://cloud.tencent.com/document/product/1366/61194)。
